In [1]:
import pandas as pd 
import numpy as np

In [2]:
data = pd.read_csv('House_Data.csv')

In [3]:
data.sample(5)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
10950,Super built-up Area,Ready To Move,Anekal,2 BHK,NaN,680,1.0,1.0,21.00
1841,Super built-up Area,20-Jan,Badavala Nagar,3 BHK,DNncasa,1494,2.0,2.0,94.55
11636,Super built-up Area,Ready To Move,Green Glen Layout,3 BHK,Solia D,1750,3.0,2.0,105.00
9232,Super built-up Area,18-Dec,Ramamurthy Nagar,2 BHK,Vaharvi,1170,2.0,2.0,44.00
12910,Built-up Area,18-Aug,Electronic City Phase II,2 BHK,Sryalan,1200,2.0,1.0,34.65

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [5]:
for col in data.columns:
    print(data[col].value_counts())
    print('-'*40)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
----------------------------------------
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Jan               1
16-Nov               1
15-Aug               1
16-Jul               1
14-Jul               1
Name: availability, Length: 81, dtype: int64
----------------------------------------
Whitefield          540
Sarjapur  Road      399
Electronic City     302
Kanakpura Road      273
Thanisandra         234
                   ...
Agara Village         1
Chellikere            1
1Kasavanhalli         1
Malur Hosur Road      1
Duddanahalli          1
Name: location, Length: 1305, dtype: int64
----------------------------------------
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
18 Bedroom       1
43 Bedroom       1
16 BHK           1
14 BHK           1
27 BHK           1
19 BHK           1
13 BHK           1
12 Bedroom       1
Name: size, dtype: int64
----------------------------------------
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
SrageGl     1
Srigmsw     1
EcEONfe     1
Chisea      1
Bhgarve     1
Name: society, Length: 2688, dtype: int64
----------------------------------------
1200          843
1100          221
1500          205
2400          196
600           180
             ...
3056            1
3309            1
4382            1
943 - 1220      1
787             1
Name: total_sqft, Length: 2117, dtype: int64
----------------------------------------
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
14.0       1
40.0       1
18.0       1
27.0       1
15.0       1
Name: bath, dtype: int64
----------------------------------------
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
----------------------------------------
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
45.69       1
85.41       1
91.31       1
102.92      1
62.28       1
Name: price, Length: 1994, dtype: int64
----------------------------------------

In [6]:
data.isna().sum()
#data.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [7]:
data.drop(columns=['area_type','availability','society','balcony'],inplace=True)

In [8]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [10]:
data['location'].value_counts()

Whitefield          540
Sarjapur  Road      399
Electronic City     302
Kanakpura Road      273
Thanisandra         234
                   ...
Agara Village         1
Chellikere            1
1Kasavanhalli         1
Malur Hosur Road      1
Duddanahalli          1
Name: location, Length: 1305, dtype: int64

In [11]:
data['location'] = data['location'].fillna('Whitefield')

In [12]:
data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
18 Bedroom       1
43 Bedroom       1
16 BHK           1
14 BHK           1
27 BHK           1
19 BHK           1
13 BHK           1
12 Bedroom       1
Name: size, dtype: int64

In [13]:
data['size'] = data['size'].fillna('2 BHK')

In [14]:
data['bath'] = data['bath'].fillna(data['bath'].median())

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [16]:
data['bhk'] = data['size'].str.split().str.get(0).astype(int)

In [17]:
data[data.bhk > 20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [18]:
data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [19]:
def fixrange(x):
    y = x.split('-')
    if len(y)==2 :
        return (float(y[0]) + float(y[1]))/2
    try :
        return float(x)
    except :
        return None

In [20]:
data['total_sqft'] = data['total_sqft'].apply(fixrange)

In [21]:
data['price_per_sqft'] = data['price']*100000 / data['total_sqft']

In [22]:
data['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [23]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [24]:
data['location'].value_counts()

Whitefield          541
Sarjapur  Road      399
Electronic City     302
Kanakpura Road      273
Thanisandra         234
                   ...
Agara Village         1
Chellikere            1
1Kasavanhalli         1
Malur Hosur Road      1
Duddanahalli          1
Name: location, Length: 1305, dtype: int64

In [25]:
data['location'] = data['location'].apply(lambda x : x.strip())
total_location = data['location'].value_counts()

In [26]:
total_location

Whitefield                                      542
Sarjapur  Road                                  399
Electronic City                                 304
Kanakpura Road                                  273
Thanisandra                                     237
                                               ...
Popular Colony                                    1
Virgonagar                                        1
2 Bedroom Furnished Farm House in Kolar Road      1
AGB Layout                                        1
Duddanahalli                                      1
Name: location, Length: 1294, dtype: int64

In [27]:
other_location = total_location[total_location<10]
other_location

B Narayanapura                                  9
Gollahalli                                      9
2nd Phase JP Nagar                              9
KUDLU MAIN ROAD                                 9
Jakkur Plantation                               9
                                               ..
Popular Colony                                  1
Virgonagar                                      1
2 Bedroom Furnished Farm House in Kolar Road    1
AGB Layout                                      1
Duddanahalli                                    1
Name: location, Length: 1040, dtype: int64

In [28]:
data['location'] = data['location'].apply(lambda x: 'other' if x in other_location else x)

In [29]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [30]:
(data['total_sqft']/data['bhk']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [31]:
data = data[((data['total_sqft']/data['bhk']) > 350)]

In [32]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12143.000000  12143.000000  12143.000000  12143.000000    12143.000000
mean    1609.319806      2.536523    110.974702      2.621099     6181.269975
std     1275.869042      1.049019    153.387450      0.943716     4014.176214
min      351.000000      1.000000      8.440000      1.000000      267.829813
25%     1125.000000      2.000000     49.285000      2.000000     4200.000000
50%     1310.000000      2.000000     69.610000      3.000000     5263.157895
75%     1715.000000      3.000000    115.000000      3.000000     6805.045957
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [33]:
data.shape

(12143, 7)

In [34]:
data.price_per_sqft.describe()

count     12143.000000
mean       6181.269975
std        4014.176214
min         267.829813
25%        4200.000000
50%        5263.157895
75%        6805.045957
max      176470.588235
Name: price_per_sqft, dtype: float64

In [35]:
def outlier_pps(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        mean = np.mean(subdf.price_per_sqft)
        std_dev = np.std(subdf.price_per_sqft)
        wo_ol_df = subdf[(subdf.price_per_sqft > (mean - std_dev)) & (subdf.price_per_sqft <= (mean + std_dev))]
        df_out = pd.concat([df_out,wo_ol_df],ignore_index=True)
    return df_out
data = outlier_pps(data)
data.describe()

         total_sqft         bath        price          bhk  price_per_sqft
count   9849.000000  9849.000000  9849.000000  9849.000000     9849.000000
mean    1519.706735     2.461976    91.755650     2.558635     5627.257827
std      900.895535     0.956826    88.993161     0.872473     2225.150219
min      351.000000     1.000000    10.000000     1.000000      912.151821
25%     1116.000000     2.000000    49.475000     2.000000     4250.000000
50%     1298.000000     2.000000    67.000000     2.000000     5165.631470
75%     1652.000000     3.000000   100.000000     3.000000     6388.415673
max    30400.000000    16.000000  2200.000000    16.000000    24509.803922

In [36]:
def outlier_bhk(df):
    exclude = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_desc = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_desc[bhk] = {
                'mean':np.mean(bhk_df.price_per_sqft),
                'std_dev':np.std(bhk_df.price_per_sqft),
                'total_count':bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_desc.get(bhk-1)
            if stats and stats['total_count']>5 :
                exclude = np.append(exclude, bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude, axis='index')

In [37]:
data = outlier_bhk(data)

In [38]:
data

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,1st Block Jayanagar,4 BHK,2850.0,4.0,428.0,4,15017.543860
1,1st Block Jayanagar,3 BHK,1630.0,3.0,194.0,3,11901.840491
2,1st Block Jayanagar,3 BHK,1875.0,2.0,235.0,3,12533.333333
3,1st Block Jayanagar,3 BHK,1200.0,2.0,130.0,3,10833.333333
4,1st Block Jayanagar,2 BHK,1235.0,2.0,148.0,2,11983.805668
...,...,...,...,...,...,...,...
9840,other,2 BHK,1200.0,2.0,70.0,2,5833.333333
9841,other,1 BHK,1800.0,1.0,200.0,1,11111.111111
9844,other,2 BHK,1353.0,2.0,110.0,2,8130.081301
9845,other,1 Bedroom,812.0,1.0,26.0,1,3201.970443
9848,other,4 BHK,3600.0,5.0,400.0,4,11111.111111

In [39]:
data.drop(columns=['size','price_per_sqft'],inplace=True)

In [40]:
data.sample(5)

           location  total_sqft  bath  price  bhk
1557  Chikkabanavar      1600.0   2.0   80.0    3
1393       Budigere      1820.0   3.0   95.0    3
9524          other      1308.0   2.0   86.0    2
1046     Begur Road      1200.0   2.0   44.0    2
7145     Whitefield      2928.0   4.0  198.0    4

In [41]:
data.to_csv('Cleaned.csv')

In [42]:
X = data.drop(columns=['price'])
y = data['price']

In [43]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression, Lasso, Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [44]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [45]:
print(X_train.shape)
print(X_test.shape)

(5681, 4)
(1421, 4)

## Applying Linear Regression

In [46]:
col_trans = make_column_transformer((OneHotEncoder(sparse=False),['location']),remainder='passthrough')

In [47]:
scaler = StandardScaler()

In [48]:
lr = LinearRegression(normalize=True)

In [49]:
lr_pipe = make_pipeline(col_trans,scaler,lr)

In [50]:
lr_pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [51]:
y_pred_lr = lr_pipe.predict(X_test)

In [52]:
r2_score(y_test, y_pred_lr)

0.8030509562877524

## Applying Lasso Regresion

In [53]:
lasso = Lasso()

In [54]:
lasso_pipe = make_pipeline(col_trans, scaler, lasso)

In [55]:
lasso_pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [56]:
y_pred_lasso = lasso_pipe.predict(X_test)

In [57]:
r2_score(y_test,y_pred_lasso)

0.7923899663784559

## Applying Ridge Regression

In [58]:
ridge = Ridge()

In [59]:
ridge_pipe = make_pipeline(col_trans, scaler, ridge)

In [60]:
ridge_pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [61]:
y_pred_ridge = ridge_pipe.predict(X_test)

In [62]:
r2_score(y_test,y_pred_ridge)

0.802766468311825

In [63]:
print('Linear Regression Accuracy : ',r2_score(y_test,y_pred_lr))
print('Lasso Regression Accuracy : ',r2_score(y_test,y_pred_lasso))
print('Ridge Regression Accuracy : ',r2_score(y_test,y_pred_ridge))

Linear Regression Accuracy :  0.8030509562877524
Lasso Regression Accuracy :  0.7923899663784559
Ridge Regression Accuracy :  0.802766468311825

In [64]:
import pickle

In [65]:
pickle.dump(lr_pipe, open('lr_model.pkl','wb'))

In [67]:
pickle.dump(data, open('df.pkl','wb'))